# Pandas CheatSheet

In [1]:
import pandas as pd
import numpy as np

In [2]:
data={
    'name': ['Alice', 'Bob', 'Charles', 'David', 'Eric'],
    'year': [2017, 2017, 2017, 2017, 2017], 
    'salary': [40000, 24000, 31000, 20000, 30000],
    'pair':[{'a':1},{'a':2},{'a':3},{'a':4},{'a':5}]
}

In [3]:
d=pd.DataFrame(data)

In [4]:
d

      name      pair  salary  year
0    Alice  {'a': 1}   40000  2017
1      Bob  {'a': 2}   24000  2017
2  Charles  {'a': 3}   31000  2017
3    David  {'a': 4}   20000  2017
4     Eric  {'a': 5}   30000  2017

In [5]:
d.pair

0    {'a': 1}
1    {'a': 2}
2    {'a': 3}
3    {'a': 4}
4    {'a': 5}
Name: pair, dtype: object

In [6]:
type(d.pair)

pandas.core.series.Series

In [7]:
d.pair.tolist

<bound method IndexOpsMixin.tolist of 0    {'a': 1}
1    {'a': 2}
2    {'a': 3}
3    {'a': 4}
4    {'a': 5}
Name: pair, dtype: object>

# 薪水大于20000的人都有谁？

In [8]:
d.query('salary>20000')

      name      pair  salary  year
0    Alice  {'a': 1}   40000  2017
1      Bob  {'a': 2}   24000  2017
2  Charles  {'a': 3}   31000  2017
4     Eric  {'a': 5}   30000  2017

In [9]:
d[d.salary>20000]

      name      pair  salary  year
0    Alice  {'a': 1}   40000  2017
1      Bob  {'a': 2}   24000  2017
2  Charles  {'a': 3}   31000  2017
4     Eric  {'a': 5}   30000  2017

In [10]:
d.salary>20000

0     True
1     True
2     True
3    False
4     True
Name: salary, dtype: bool

## Eric的信息是什么？

In [11]:
d.query("name=='Eric'")

   name      pair  salary  year
4  Eric  {'a': 5}   30000  2017

In [12]:
d[d.name=='Eric']

   name      pair  salary  year
4  Eric  {'a': 5}   30000  2017

In [13]:
d.loc[d.name=='Eric']

   name      pair  salary  year
4  Eric  {'a': 5}   30000  2017

## 联合查找：名叫Bob且薪水大于20000

In [14]:
d.query("name=='Bob' and salary>20000")

  name      pair  salary  year
1  Bob  {'a': 2}   24000  2017

## 列操作
d.filter

在SQL中经常使用的 SELECT name,year,salary from table 是对二阶张量的行列进行赛选

In [15]:
d.filter(items=['name','salary','pair'])

      name  salary      pair
0    Alice   40000  {'a': 1}
1      Bob   24000  {'a': 2}
2  Charles   31000  {'a': 3}
3    David   20000  {'a': 4}
4     Eric   30000  {'a': 5}

In [16]:
d[['name','salary']]

      name  salary
0    Alice   40000
1      Bob   24000
2  Charles   31000
3    David   20000
4     Eric   30000

## 模糊查找

In [17]:
d.filter(like='2', axis=0) # 模糊查找行

      name      pair  salary  year
2  Charles  {'a': 3}   31000  2017

In [18]:
d.filter(like='ea', axis=1) # 模糊查找列

   year
0  2017
1  2017
2  2017
3  2017
4  2017

## 分组

In [19]:
df1 = pd.DataFrame({
    "Name" : ["Alice", "Ada", "Mallory", "Mallory", "Billy" , "Mallory"],
    "City" : ["Sydney", "Sydney", "Paris", "Sydney", "Sydney", "Paris"]
})

In [20]:
df1

     City     Name
0  Sydney    Alice
1  Sydney      Ada
2   Paris  Mallory
3  Sydney  Mallory
4  Sydney    Billy
5   Paris  Mallory

## 各个城市各有多少人

In [21]:
df1.groupby(['City']).count()

        Name
City
Paris      2
Sydney     4

## 统计量分析
Numerical 变量的数据分析

In [22]:
d.describe()

             salary    year
count      5.000000     5.0
mean   29000.000000  2017.0
std     7615.773106     0.0
min    20000.000000  2017.0
25%    24000.000000  2017.0
50%    30000.000000  2017.0
75%    31000.000000  2017.0
max    40000.000000  2017.0

## 统计函数

In [23]:
df2=pd.DataFrame({
    'key1':['a', 'a', 'b', 'b', 'a'],
    'key2':['one', 'two', 'one', 'two', 'one'],
    'data1':np.random.randn(5),
    'data2':np.random.randn(5)
})

In [24]:
df2

      data1     data2 key1 key2
0 -1.491823  0.084684    a  one
1 -2.103263  0.432440    a  two
2  0.950192 -0.235840    b  one
3  0.493304 -0.907539    b  two
4 -0.608515  0.970593    a  one

### 基于属性key1的类型a和b各自的均值是多少（包括data1和data2但不包括key2）

In [25]:
df2.groupby(['key1']).mean()

         data1     data2
key1
a    -1.401200  0.495906
b     0.721748 -0.571690

联合Group：'a-one','a-two','b-one','b-two'

In [26]:
df2.groupby(['key1', 'key2']).mean()

              data1     data2
key1 key2
a    one  -1.050169  0.527639
     two  -2.103263  0.432440
b    one   0.950192 -0.235840
     two   0.493304 -0.907539

In [27]:
df2.count() # 每一列中的个数

data1    5
data2    5
key1     5
key2     5
dtype: int64

In [28]:
df2.groupby(['key1']).count()

      data1  data2  key2
key1
a         3      3     3
b         2      2     2

In [29]:
df2.groupby(['key1', 'key2']).count()

           data1  data2
key1 key2
a    one       2      2
     two       1      1
b    one       1      1
     two       1      1

### 排序

In [30]:
df2

      data1     data2 key1 key2
0 -1.491823  0.084684    a  one
1 -2.103263  0.432440    a  two
2  0.950192 -0.235840    b  one
3  0.493304 -0.907539    b  two
4 -0.608515  0.970593    a  one

In [31]:
df2.data2.sort_values() # 对列进行排序

3   -0.907539
2   -0.235840
0    0.084684
1    0.432440
4    0.970593
Name: data2, dtype: float64

In [32]:
df2.sort_values(by='key2') # 整张表按某1列的数值进行排序

      data1     data2 key1 key2
0 -1.491823  0.084684    a  one
2  0.950192 -0.235840    b  one
4 -0.608515  0.970593    a  one
1 -2.103263  0.432440    a  two
3  0.493304 -0.907539    b  two

### 多属性排序

In [33]:
df2.sort_values(by=['key1','data1']) # 相同再按后面排序

      data1     data2 key1 key2
1 -2.103263  0.432440    a  two
0 -1.491823  0.084684    a  one
4 -0.608515  0.970593    a  one
3  0.493304 -0.907539    b  two
2  0.950192 -0.235840    b  one

In [34]:
df2.sort_values(by=['key2'], ascending=False) # 整张表按某1列的数值进行排序

      data1     data2 key1 key2
1 -2.103263  0.432440    a  two
3  0.493304 -0.907539    b  two
0 -1.491823  0.084684    a  one
2  0.950192 -0.235840    b  one
4 -0.608515  0.970593    a  one